app/Controllers/Auth.php

    public function index()
    {
        return view('auth/v_login', [
            'title' => 'SIMALA - Login',
            'data' => $this->UserModel->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_users`