app/Controllers/Cctv.php

    public function index()
    {
        $search = trim((string) $this->request->getGet('search'));
        $query = $this->cctvModel
            ->orderBy('id', 'DESC')
            ;

        if ($search !== '') {
            $query->groupStart()
                ->like('nama_camera', $search)
                ->orLike('ip_address', $search)
                ->orLike('inventory_code', $search)
                ->groupEnd();
        }

        $cameras = $query->paginate(10);
---
SELECT *
FROM `cctv`
WHERE   (
`nama_camera` LIKE '%crane%' ESCAPE '!'
OR  `ip_address` LIKE '%crane%' ESCAPE '!'
OR  `inventory_code` LIKE '%crane%' ESCAPE '!'
 )
ORDER BY `id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `cctv`
WHERE   (
`nama_camera` LIKE '%crane%' ESCAPE '!'
OR  `ip_address` LIKE '%crane%' ESCAPE '!'
OR  `inventory_code` LIKE '%crane%' ESCAPE '!'
 )

    public function edit($id)
    {
        $camera = $this->cctvModel->find($id);
---
SELECT *
FROM `cctv`
WHERE `cctv`.`id` = '303'

    public function update($id)
    {
        if (!$this->cctvModel->find($id)) {
---
SELECT *
FROM `cctv`
WHERE `cctv`.`id` = '452'

    public function show($id)
    {
        $camera = $this->cctvModel->find($id);
---
SELECT *
FROM `cctv`
WHERE `cctv`.`id` = '339'

    private function syncMediaMtxConfig(): void
    {
        $configPath = ROOTPATH . 'streaming/mediamtx.yml';
        $config = "logLevel: info\n\nhls: yes\nhlsAddress: :8888\n\nwebrtc: yes\nwebrtcAddress: :8889\n\npaths:\n";

        foreach ($this->cctvModel->orderBy('id', 'ASC')->findAll() as $camera) {
---
SELECT *
FROM `cctv`
ORDER BY `id` ASC