app/Controllers/Cctv.php

SELECT *
FROM `cctv`
ORDER BY `id` ASC
---
    private function syncMediaMtxConfig(): void
    {
        $configPath = ROOTPATH . 'streaming/mediamtx.yml';
        $config = "logLevel: info\n\nhls: yes\nhlsAddress: :8888\n\nwebrtc: yes\nwebrtcAddress: :8889\n\npaths:\n";

        foreach ($this->cctvModel->orderBy('id', 'ASC')->findAll() as $camera) {