app/Controllers/Dashboard.php

SELECT *
FROM `cctv`
ORDER BY `id` DESC
---
    private function renderDashboard()
    {
        $alat = array_map([$this, 'prepareAlat'], $this->MonitoringAlatModel->getAlat());
        $cctv = $this->CctvModel->orderBy('id', 'DESC')->findAll();