app/Models/MonitoringAlatModel.php

SELECT *
FROM `tbl_monitoring_alat`
ORDER BY `id` DESC
---
    public function getAlat($slug = false)
    {
        if ($slug == false) {
            return $this->orderBy('id', 'DESC')->findAll();

SELECT *
FROM `tbl_monitoring_alat`
ORDER BY `id` DESC
---
    public function getFilteredAlat(array $filters = [])
    {
        $builder = $this->builder();

        foreach (['status', 'tahun', 'negara'] as $field) {
            if (!empty($filters[$field])) {
                $builder->where($field, $filters[$field]);
            }
        }

        if (!empty($filters['keterangan'])) {
            if ($filters['keterangan'] === 'Elektrifikasi') {
                $builder->where('keterangan', 'Elektrifikasi');
            } else {
                $builder->groupStart()
                    ->where('keterangan', '')
                    ->orWhere('keterangan IS NULL', null, false)
                    ->orWhere('keterangan !=', 'Elektrifikasi')
                    ->groupEnd();
            }
        }

        return $builder->orderBy('id', 'DESC')->get()->getResultArray();